// Task1.Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

/*
int CutNumber(int num)
{
    int hundred = num/100;
    int units = num % 100;

    int result = (units - (num % 10));
    return result;
}

int randNumber = new Random().Next(100,1000);
int newNumber = CutNumber(randNumber);

Console.WriteLine($"New version of {randNumber} is {newNumber}");*/


 // Task2. Напишите программу, которая выводит третью цифру заданного числа.

/*int CutNumber(int num)
{
    int hundred = num/100;
    int units = num % 10;

    int result = (units);
    return result;
}

int randNumber = new Random().Next(100,1000);
int newNumber = CutNumber(randNumber);

Console.WriteLine($"New version of {randNumber} is {newNumber}");*/


